In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("data_clean.csv")

In [3]:
data.head()

   Unnamed: 0  Ozone  Solar.R  Wind Temp C Month  Day  Year  Temp Weather
0           1   41.0    190.0   7.4     67     5    1  2010    67       S
1           2   36.0    118.0   8.0     72     5    2  2010    72       C
2           3   12.0    149.0  12.6     74     5    3  2010    74      PS
3           4   18.0    313.0  11.5     62     5    4  2010    62       S
4           5    NaN      NaN  14.3     56     5    5  2010    56       S

#MISSING VALUES AND DUPLICATE THEN REPALCE WITH DATATYPE CHANGE

In [9]:
#remove duplicate col

data.drop("Unnamed: 0",axis=1,inplace=True)
data.head()

   Ozone  Solar.R  Wind Temp C Month  Day  Year  Temp Weather
0   41.0    190.0   7.4     67     5    1  2010    67       S
1   36.0    118.0   8.0     72     5    2  2010    72       C
2   12.0    149.0  12.6     74     5    3  2010    74      PS
3   18.0    313.0  11.5     62     5    4  2010    62       S
4    NaN      NaN  14.3     56     5    5  2010    56       S

In [18]:
data.shape

(158, 9)

#so there are 158 row and 9 col

In [22]:
#detacting null or empty value
a=data.describe()
a.iloc[0,:]

Ozone      120.0
Solar.R    151.0
Wind       158.0
Day        158.0
Year       158.0
Temp       158.0
Name: count, dtype: float64

In [23]:
#ozone , solar have less leemnet then 158

In [28]:
#now cjhecking for data type error
#python will read the col as object if one elemnt is object
data.describe()

            Ozone     Solar.R        Wind         Day    Year        Temp
count  120.000000  151.000000  158.000000  158.000000   158.0  158.000000
mean    41.583333  185.403974    9.957595   16.006329  2010.0   77.727848
std     32.620709   88.723103    3.511261    8.997166     0.0    9.377877
min      1.000000    7.000000    1.700000    1.000000  2010.0   56.000000
25%     18.000000  119.000000    7.400000    8.000000  2010.0   72.000000
50%     30.500000  197.000000    9.700000   16.000000  2010.0   78.500000
75%     61.500000  257.000000   11.875000   24.000000  2010.0   84.000000
max    168.000000  334.000000   20.700000   31.000000  2010.0   97.000000

In [30]:
#wind and temp c is missing
# although its int but and not in luded mean datatype is messed up
a=set(data['Month'])
a
#this will return all unique value

{'5', '6', '7', '8', '9', 'May'}

In [34]:
# or 
b=data['Month'].unique()
b

array(['5', 'May', '6', '7', '8', '9'], dtype=object)

In [40]:
# so may is main culprit 
#replace it with 5 and change data type
#CALLING ALL MAY ROWS
data[data["Month"]=="May"]

    Ozone  Solar.R  Wind Temp C Month  Day  Year  Temp Weather
23   32.0     92.0  12.0     61   May   24  2010    61       C

In [44]:
# replace
data["Month"].replace("May", "5",inplace=True)

In [46]:
data["Month"].unique()

array(['5', '6', '7', '8', '9'], dtype=object)

In [47]:
#changing data type 
pd.to_numeric(data["Month"])

0      5
1      5
2      5
3      5
4      5
      ..
153    5
154    9
155    9
156    9
157    9
Name: Month, Length: 158, dtype: int64